#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`
<details><summary>Show Plan</summary>
```

terraform
module.project-factory["new-luis"].module.project-factory.random_string.random_project_id_suffix[0]: Refreshing state... [id=fdsl]
module.project-factory["new-luis"].module.project-factory.random_id.random_project_id_suffix: Refreshing state... [id=_Fc]
module.project-factory["new-luis"].module.gsuite_group.data.google_organization.org[0]: Reading...
module.project-factory["new-luis"].module.project-factory.google_project.main: Refreshing state... [id=projects/new-luis-fdsl]
module.project-factory["new-luis"].module.gsuite_group.data.google_organization.org[0]: Read complete after 0s [id=organizations/65202286851]
module.project-factory["new-luis"].module.project-factory.google_project_iam_member.gsuite_group_role[0]: Refreshing state... [id=new-luis-fdsl/roles/viewer/group:gcp-new-luis@luismendeze.com]
module.project-factory["new-luis"].module.project-factory.google_service_account.default_service_account[0]: Refreshing state... [id=projects/new-luis-fdsl/serviceAccounts/project-service-account@new-luis-fdsl.iam.gserviceaccount.com]
module.project-factory["new-luis"].module.project-factory.google_project_default_service_accounts.default_service_accounts[0]: Refreshing state... [id=projects/new-luis-fdsl]
module.project-factory["new-luis"].module.project-factory.google_service_account_iam_member.service_account_grant_to_group[0]: Refreshing state... [id=projects/new-luis-fdsl/serviceAccounts/project-service-account@new-luis-fdsl.iam.gserviceaccount.com/roles/iam.serviceAccountUser/group:gcp-new-luis@luismendeze.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "new-luis-fdsl"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.google_compute_shared_vpc_service_project.shared_vpc_attachment[0] will be created
  + resource "google_compute_shared_vpc_service_project" "shared_vpc_attachment" {
      + host_project    = "central-gcp-vpc-non-prod-37070"
      + id              = (known after apply)
      + service_project = "new-luis-fdsl"
    }

  # module.project-factory["new-luis"].module.project-factory.google_compute_subnetwork_iam_member.apis_service_account_role_to_vpc_subnets[0] will be created
  + resource "google_compute_subnetwork_iam_member" "apis_service_account_role_to_vpc_subnets" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:16414629361@cloudservices.gserviceaccount.com"
      + project    = "central-gcp-vpc-non-prod-37070"
      + region     = "us-west1"
      + role       = "roles/compute.networkUser"
      + subnetwork = "subnet-01"
    }

  # module.project-factory["new-luis"].module.project-factory.google_compute_subnetwork_iam_member.apis_service_account_role_to_vpc_subnets[1] will be created
  + resource "google_compute_subnetwork_iam_member" "apis_service_account_role_to_vpc_subnets" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:16414629361@cloudservices.gserviceaccount.com"
      + project    = "central-gcp-vpc-non-prod-37070"
      + region     = "us-central1"
      + role       = "roles/compute.networkUser"
      + subnetwork = "subnet-02"
    }

  # module.project-factory["new-luis"].module.project-factory.google_compute_subnetwork_iam_member.group_role_to_vpc_subnets[0] will be created
  + resource "google_compute_subnetwork_iam_member" "group_role_to_vpc_subnets" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "group:gcp-new-luis@luismendeze.com"
      + project    = "central-gcp-vpc-non-prod-37070"
      + region     = "us-west1"
      + role       = "roles/compute.networkUser"
      + subnetwork = "subnet-01"
    }

  # module.project-factory["new-luis"].module.project-factory.google_compute_subnetwork_iam_member.group_role_to_vpc_subnets[1] will be created
  + resource "google_compute_subnetwork_iam_member" "group_role_to_vpc_subnets" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "group:gcp-new-luis@luismendeze.com"
      + project    = "central-gcp-vpc-non-prod-37070"
      + region     = "us-central1"
      + role       = "roles/compute.networkUser"
      + subnetwork = "subnet-02"
    }

  # module.project-factory["new-luis"].module.project-factory.google_compute_subnetwork_iam_member.service_account_role_to_vpc_subnets[0] will be created
  + resource "google_compute_subnetwork_iam_member" "service_account_role_to_vpc_subnets" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:project-service-account@new-luis-fdsl.iam.gserviceaccount.com"
      + project    = "central-gcp-vpc-non-prod-37070"
      + region     = "us-west1"
      + role       = "roles/compute.networkUser"
      + subnetwork = "subnet-01"
    }

  # module.project-factory["new-luis"].module.project-factory.google_compute_subnetwork_iam_member.service_account_role_to_vpc_subnets[1] will be created
  + resource "google_compute_subnetwork_iam_member" "service_account_role_to_vpc_subnets" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:project-service-account@new-luis-fdsl.iam.gserviceaccount.com"
      + project    = "central-gcp-vpc-non-prod-37070"
      + region     = "us-central1"
      + role       = "roles/compute.networkUser"
      + subnetwork = "subnet-02"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @luismendezescobar, Action: `pull_request`, Working Directory: ``, Workflow: `validate code`*